### 1. Importei as bibliotecas

In [55]:
import pandas as pd

### 2. Carreguei o dataset e fiz uma análise inicial

In [56]:
data = pd.read_csv('raw_customers.csv')
data.info()
data.head(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              2000 non-null   int64
 1   Gender                  2000 non-null   object
 2   Age                     2000 non-null   int64
 3   Annual Income ($)       2000 non-null   int64
 4   Spending Score (1-100)  2000 non-null   int64
 5   Profession              1965 non-null   object
 6   Work Experience         2000 non-null   int64
 7   Family Size             2000 non-null   int64
dtypes: int64(6), object(2)
memory usage: 125.1+ KB

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6
5,6,Female,22,58000,76,Artist,0,2
6,7,Female,35,31000,6,Healthcare,1,3
7,8,Female,23,84000,94,Healthcare,1,3
8,9,Male,64,97000,3,Engineer,0,3
9,10,Female,30,98000,72,Artist,1,4

### 3. Removi as colunas que não serão utilizadas

In [57]:
data = data.drop(['CustomerID'], axis=1)
data.head(10)

,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,Male,19,15000,39,Healthcare,1,4
1,Male,21,35000,81,Engineer,3,3
2,Female,20,86000,6,Engineer,1,1
3,Female,23,59000,77,Lawyer,0,2
4,Female,31,38000,40,Entertainment,2,6
5,Female,22,58000,76,Artist,0,2
6,Female,35,31000,6,Healthcare,1,3
7,Female,23,84000,94,Healthcare,1,3
8,Male,64,97000,3,Engineer,0,3
9,Female,30,98000,72,Artist,1,4

### 4. Removi as linhas com valores nulos

In [58]:
data = data.dropna()
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1965 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Gender                  1965 non-null   object
 1   Age                     1965 non-null   int64
 2   Annual Income ($)       1965 non-null   int64
 3   Spending Score (1-100)  1965 non-null   int64
 4   Profession              1965 non-null   object
 5   Work Experience         1965 non-null   int64
 6   Family Size             1965 non-null   int64
dtypes: int64(5), object(2)
memory usage: 122.8+ KB

### 5. Verifiquei valores duplicados

In [59]:
data.duplicated().sum()

0

### 6. Renomeei as colunas para facilitar a manipulação

In [60]:
cols = ['gender', 'age', 'anual_income', 'spending_score', 'profession', 'work_experience', 'family_size']
data.columns = cols
data.head(10)

,gender,age,anual_income,spending_score,profession,work_experience,family_size
0,Male,19,15000,39,Healthcare,1,4
1,Male,21,35000,81,Engineer,3,3
2,Female,20,86000,6,Engineer,1,1
3,Female,23,59000,77,Lawyer,0,2
4,Female,31,38000,40,Entertainment,2,6
5,Female,22,58000,76,Artist,0,2
6,Female,35,31000,6,Healthcare,1,3
7,Female,23,84000,94,Healthcare,1,3
8,Male,64,97000,3,Engineer,0,3
9,Female,30,98000,72,Artist,1,4

### 7. Verifiquei a quantidade de valores únicos para cada coluna

In [61]:
data.nunique()

gender                2
age                 100
anual_income       1755
spending_score      101
profession            9
work_experience      18
family_size           9
dtype: int64

### 8. Exportei o dataset para um arquivo csv

In [62]:
pd.DataFrame.to_csv(data, 'new_customers.csv', index=False)